benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-run1.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.447ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.44ms  672.04us   4.79ms   68.16%
    Req/Sec    35.84k     2.02k   42.33k    64.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.33ms
 75.000%    1.81ms
 90.000%    2.45ms
 99.000%    3.19ms
 99.900%    3.44ms
 99.990%    4.14ms
 99.999%    4.59ms
100.000%    4.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.040     0.000000            1         1.00
       0.659     0.100000        67194         1.11
       0.863     0.200000       134469         1.25
       1.023     0.300000       201142         1.43
       1.179     0.400000       268346         1.67
       1.330     0.500000       335402         2.00
       1.406     0.550000       369023         2.22
       1.487     0.600000       402513         2.50
       1.576     0.650000       435829         2.86
       1.680     0.700000       469302         3.33
       1.809     0.750000       502928         4.00
       1.892     0.775000       519664         4.44
       1.989     0.800000       536367         5.00
       2.097     0.825000       553380         5.71
       2.207     0.850000       570136         6.67
       2.327     0.875000       586807         8.00
       2.393     0.887500       595129         8.89
       2.453     0.900000       603352        10.00
       2.519     0.912500       611725        11.43
       2.593     0.925000       620295        13.33
       2.675     0.937500       628544        16.00
       2.723     0.943750       632753        17.78
       2.773     0.950000       636957        20.00
       2.825     0.956250       641136        22.86
       2.879     0.962500       645322        26.67
       2.939     0.968750       649551        32.00
       2.971     0.971875       651631        35.56
       3.005     0.975000       653660        40.00
       3.041     0.978125       655819        45.71
       3.077     0.981250       657835        53.33
       3.115     0.984375       659922        64.00
       3.135     0.985938       660953        71.11
       3.155     0.987500       662049        80.00
       3.175     0.989062       663079        91.43
       3.197     0.990625       664179       106.67
       3.219     0.992188       665218       128.00
       3.231     0.992969       665701       142.22
       3.245     0.993750       666259       160.00
       3.257     0.994531       666736       182.86
       3.273     0.995313       667275       213.33
       3.289     0.996094       667762       256.00
       3.299     0.996484       668032       284.44
       3.311     0.996875       668312       320.00
       3.323     0.997266       668559       365.71
       3.337     0.997656       668809       426.67
       3.355     0.998047       669094       512.00
       3.365     0.998242       669220       568.89
       3.377     0.998437       669347       640.00
       3.391     0.998633       669467       731.43
       3.409     0.998828       669597       853.33
       3.445     0.999023       669727      1024.00
       3.489     0.999121       669788      1137.78
       3.521     0.999219       669853      1280.00
       3.567     0.999316       669918      1462.86
       3.621     0.999414       669985      1706.67
       3.675     0.999512       670048      2048.00
       3.709     0.999561       670083      2275.56
       3.749     0.999609       670114      2560.00
       3.791     0.999658       670148      2925.71
       3.831     0.999707       670179      3413.33
       3.887     0.999756       670212      4096.00
       3.919     0.999780       670228      4551.11
       3.951     0.999805       670245      5120.00
       3.993     0.999829       670263      5851.43
       4.039     0.999854       670278      6826.67
       4.093     0.999878       670294      8192.00
       4.111     0.999890       670302      9102.22
       4.135     0.999902       670310     10240.00
       4.155     0.999915       670318     11702.86
       4.223     0.999927       670326     13653.33
       4.251     0.999939       670335     16384.00
       4.267     0.999945       670339     18204.44
       4.291     0.999951       670344     20480.00
       4.307     0.999957       670348     23405.71
       4.327     0.999963       670351     27306.67
       4.363     0.999969       670355     32768.00
       4.395     0.999973       670357     36408.89
       4.399     0.999976       670359     40960.00
       4.431     0.999979       670361     46811.43
       4.451     0.999982       670363     54613.33
       4.475     0.999985       670365     65536.00
       4.491     0.999986       670366     72817.78
       4.503     0.999988       670367     81920.00
       4.591     0.999989       670368     93622.86
       4.611     0.999991       670369    109226.67
       4.671     0.999992       670370    131072.00
       4.711     0.999993       670371    145635.56
       4.711     0.999994       670371    163840.00
       4.715     0.999995       670372    187245.71
       4.715     0.999995       670372    218453.33
       4.767     0.999996       670373    262144.00
       4.767     0.999997       670373    291271.11
       4.767     0.999997       670373    327680.00
       4.791     0.999997       670374    374491.43
       4.791     0.999998       670374    436906.67
       4.791     0.999998       670374    524288.00
       4.791     0.999998       670374    582542.22
       4.791     0.999998       670374    655360.00
       4.795     0.999999       670375    748982.86
       4.795     1.000000       670375          inf
#[Mean    =        1.439, StdDeviation   =        0.672]
#[Max     =        4.792, Total count    =       670375]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  987808 requests in 30.00s, 122.47MB read
Requests/sec:  32926.88
Transfer/sec:      4.08MB