benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-run2.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.444ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.44ms  674.38us   5.96ms   67.53%
    Req/Sec    35.75k     2.14k   40.67k    66.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.33ms
 75.000%    1.83ms
 90.000%    2.45ms
 99.000%    3.18ms
 99.900%    3.63ms
 99.990%    4.26ms
 99.999%    4.91ms
100.000%    5.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.041     0.000000            1         1.00
       0.651     0.100000        67229         1.11
       0.856     0.200000       134363         1.25
       1.020     0.300000       201356         1.43
       1.175     0.400000       268430         1.67
       1.328     0.500000       335459         2.00
       1.407     0.550000       369030         2.22
       1.492     0.600000       402474         2.50
       1.586     0.650000       435902         2.86
       1.694     0.700000       469385         3.33
       1.828     0.750000       502982         4.00
       1.915     0.775000       519644         4.44
       2.011     0.800000       536418         5.00
       2.113     0.825000       553354         5.71
       2.217     0.850000       570154         6.67
       2.331     0.875000       586831         8.00
       2.391     0.887500       595289         8.89
       2.449     0.900000       603394        10.00
       2.513     0.912500       611917        11.43
       2.583     0.925000       620183        13.33
       2.663     0.937500       628572        16.00
       2.705     0.943750       632791        17.78
       2.751     0.950000       637028        20.00
       2.799     0.956250       641221        22.86
       2.853     0.962500       645421        26.67
       2.911     0.968750       649582        32.00
       2.943     0.971875       651595        35.56
       2.979     0.975000       653702        40.00
       3.019     0.978125       655862        45.71
       3.059     0.981250       657962        53.33
       3.099     0.984375       660059        64.00
       3.119     0.985938       661065        71.11
       3.141     0.987500       662116        80.00
       3.165     0.989062       663174        91.43
       3.189     0.990625       664233       106.67
       3.213     0.992188       665273       128.00
       3.225     0.992969       665767       142.22
       3.237     0.993750       666251       160.00
       3.253     0.994531       666788       182.86
       3.271     0.995313       667336       213.33
       3.291     0.996094       667816       256.00
       3.305     0.996484       668096       284.44
       3.321     0.996875       668366       320.00
       3.339     0.997266       668623       365.71
       3.365     0.997656       668873       426.67
       3.403     0.998047       669123       512.00
       3.435     0.998242       669256       568.89
       3.477     0.998437       669388       640.00
       3.517     0.998633       669517       731.43
       3.579     0.998828       669647       853.33
       3.637     0.999023       669781      1024.00
       3.663     0.999121       669842      1137.78
       3.695     0.999219       669910      1280.00
       3.725     0.999316       669974      1462.86
       3.771     0.999414       670043      1706.67
       3.813     0.999512       670104      2048.00
       3.843     0.999561       670137      2275.56
       3.883     0.999609       670172      2560.00
       3.919     0.999658       670202      2925.71
       3.967     0.999707       670235      3413.33
       4.031     0.999756       670269      4096.00
       4.061     0.999780       670285      4551.11
       4.089     0.999805       670302      5120.00
       4.119     0.999829       670319      5851.43
       4.155     0.999854       670334      6826.67
       4.215     0.999878       670351      8192.00
       4.239     0.999890       670358      9102.22
       4.267     0.999902       670367     10240.00
       4.291     0.999915       670374     11702.86
       4.319     0.999927       670383     13653.33
       4.367     0.999939       670391     16384.00
       4.383     0.999945       670395     18204.44
       4.399     0.999951       670399     20480.00
       4.451     0.999957       670404     23405.71
       4.511     0.999963       670407     27306.67
       4.587     0.999969       670411     32768.00
       4.599     0.999973       670413     36408.89
       4.635     0.999976       670415     40960.00
       4.739     0.999979       670417     46811.43
       4.795     0.999982       670419     54613.33
       4.859     0.999985       670421     65536.00
       4.883     0.999986       670422     72817.78
       4.899     0.999988       670423     81920.00
       4.911     0.999989       670424     93622.86
       4.919     0.999991       670425    109226.67
       4.939     0.999992       670426    131072.00
       4.959     0.999993       670427    145635.56
       4.959     0.999994       670427    163840.00
       5.175     0.999995       670428    187245.71
       5.175     0.999995       670428    218453.33
       5.787     0.999996       670429    262144.00
       5.787     0.999997       670429    291271.11
       5.787     0.999997       670429    327680.00
       5.843     0.999997       670430    374491.43
       5.843     0.999998       670430    436906.67
       5.843     0.999998       670430    524288.00
       5.843     0.999998       670430    582542.22
       5.843     0.999998       670430    655360.00
       5.959     0.999999       670431    748982.86
       5.959     1.000000       670431          inf
#[Mean    =        1.440, StdDeviation   =        0.674]
#[Max     =        5.956, Total count    =       670431]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1016592 requests in 30.00s, 126.03MB read
Requests/sec:  33884.99
Transfer/sec:      4.20MB